podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/ADC0_MKE16F16.svd.xml
            <register>
               <name>SC3</name>
               <description>Status and Control Register 3</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>AVGS</name>
                     <description>Hardware Average Select\n
Selects the number of averages taken if hardware averaging is enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>4 samples</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>8 samples</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>16 samples</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>32 samples</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AVGE</name>
                     <description>Hardware Average Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCO</name>
                     <description>Continuous Conversion Enable\n
Enables continuous conversions or sets of conversions (when averaging) after an initial trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>One set of conversions</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Continuous conversions</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAL</name>
                     <description>Calibration\n
Write 1 to begin the calibration sequence, clears when complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Calibration Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>w1 start/r1 busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASE_OFS</name>
               <description>BASE Offset Register</description>
               <addressOffset>0x98</addressOffset>
               <resetValue>0x40</resetValue>
               <fields>
                  <field>
                     <name>BA_OFS</name>
                     <description>Base Offset Error Correction Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFS</name>
               <description>Offset Correction Register</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>OFS</name>
                     <description>Offset Error Correction Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USR_OFS</name>
               <description>USER Offset Correction Register</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>USR_OFS</name>
                     <description>USER Offset Error Correction Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOFS</name>
               <description>X Offset Correction Register</description>
               <addressOffset>0xA4</addressOffset>
               <resetValue>0x30</resetValue>
               <fields>
                  <field>
                     <name>XOFS</name>
                     <description>X offset error correction value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>YOFS</name>
               <description>Y Offset Correction Register</description>
               <addressOffset>0xA8</addressOffset>
               <resetValue>0x37</resetValue>
               <fields>
                  <field>
                     <name>YOFS</name>
                     <description>Y Offset Error Correction Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>G</name>
               <description>Gain Register</description>
               <addressOffset>0xAC</addressOffset>
               <resetValue>0x2F0</resetValue>
               <fields>
                  <field>
                     <name>G</name>
                     <description>Gain error adjustment factor for the overall conversion</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UG</name>
               <description>User Gain Register</description>
               <addressOffset>0xB0</addressOffset>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>UG</name>
                     <description>User gain error correction value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPS</name>
               <description>General Calibration Value Register S</description>
               <addressOffset>0xB4</addressOffset>
               <resetValue>0x2E</resetValue>
               <fields>
                  <field>
                     <name>CLPS</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP3</name>
               <description>Plus-Side General Calibration Value Register 3</description>
               <addressOffset>0xB8</addressOffset>
               <resetValue>0x180</resetValue>
               <fields>
                  <field>
                     <name>CLP3</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP2</name>
               <description>Plus-Side General Calibration Value Register 2</description>
               <addressOffset>0xBC</addressOffset>
               <resetValue>0xB8</resetValue>
               <fields>
                  <field>
                     <name>CLP2</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP1</name>
               <description>Plus-Side General Calibration Value Register 1</description>
               <addressOffset>0xC0</addressOffset>
               <resetValue>0x5C</resetValue>
               <fields>
                  <field>
                     <name>CLP1</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP0</name>
               <description>Plus-Side General Calibration Value Register 0</description>
               <addressOffset>0xC4</addressOffset>
               <resetValue>0x2E</resetValue>
               <fields>
                  <field>
                     <name>CLP0</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPX</name>
               <description>Plus-Side General Calibration Value Register X</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>CLPX</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP9</name>
               <description>Plus-Side General Calibration Value Register 9</description>
               <addressOffset>0xCC</addressOffset>
               <fields>
                  <field>
                     <name>CLP9</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPS_OFS</name>
               <description>General Calibration Offset Value Register S</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>CLPS_OFS</name>
                     <description>CLPS Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP3_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register 3</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>CLP3_OFS</name>
                     <description>CLP3 Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP2_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register 2</description>
               <addressOffset>0xD8</addressOffset>
               <fields>
                  <field>
                     <name>CLP2_OFS</name>
                     <description>CLP2 Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP1_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register 1</description>
               <addressOffset>0xDC</addressOffset>
               <fields>
                  <field>
                     <name>CLP1_OFS</name>
                     <description>CLP1 Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP0_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register 0</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>CLP0_OFS</name>
                     <description>CLP0 Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPX_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register X</description>
               <addressOffset>0xE4</addressOffset>
               <resetValue>0x440</resetValue>
               <fields>
                  <field>
                     <name>CLPX_OFS</name>
                     <description>CLPX Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP9_OFS</name>
               <description>Plus-Side General Calibration Offset Value Register 9</description>
               <addressOffset>0xE8</addressOffset>
               <resetValue>0x240</resetValue>
               <fields>
                  <field>
                     <name>CLP9_OFS</name>
                     <description>CLP9 Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
